# if语句格式
# if 判断条件:      (这个冒号必须有)
#    条件成立时要执行的语句        (通过缩进决定语句所属的循环)


# if...else...
# 格式：
# if 条件表达式:
#     条件成立时需要执行的语句1
#     条件成立时需要执行的语句2...
# else:
#      条件不满足时需要执行的语句01
#      条件不满足时需要执行的语句02...

"""age = int(input("请输入你的年龄："))
if age>=22:
    print(f"您的年龄为{age}已经达到了法定可以结婚的年龄")
else:       # else语句和if同级，不需要缩进
    print(f"您的年龄为{age}，还未达到是法定结婚年龄")"""


# if...elif...elif...多条件语句判断
# 格式：
# if 条件表达式1:
#     表达式1满足时需要执行的语句
# elif 表达式2:
#     表达式2满足时需要执行的语句
# elif 表达式n:
# ...
# else:
#     所有表达式都不成立时需要执行的语句


# 判断语句的嵌套（通过空格缩进匹配if 和 else）
